package class8;

public class page247_메소드 {

    /*
        메소드 = 함수
            1. 구성 : 1. 리턴타입 2.메소드이름 3.매개변수선언 4.메소드 실행블록
                1.리턴타입 : 메소드를 실행한 후의 결과값

        함수 : 함[상자] 수[숫자] : 상자 안에 들어있는수 ---> 미리 넣어준 수 ---> 미리 정의된 수
            1. 정의 : 미리 정의된 코드
                왜?? 미리 정의할까??
                1. 미리 정의하면 정의된 코드를 재사용이 편하다. [ 재활용성이 좋다 ]
                2. 인수에 따른 서로 다른 결과값
            2. 형태
                X = 3  Y = 5       인수 : 함수에 들어가는 수          [ X = 3 , Y = 5 ]
                |---      ----|
                |             |    함수 : 미리 정의된 코드           [ X + Y ]
                |    X + Y    |
                |_____    ____|
                        8          반환 : 함수를 실행한 후의 결과값  [ 8 ] <--- 결과에 출력되는 자료형[ 반환타입 ]
           3.  선언 방식
                int 내가만든함수( int x , int y ) {
                    int result = x + y;
                    return result;
                }
                1. 반환타입 : int                   <---- retrun 되는 변수의 자료형 작성
                2. 메소드이름 : 내가만든함수         <---- 아무거나
                3. 매개변수 : ( int x , int y )     <---- 함수로 들어오는 변수선언 = 인수
                4. {    }                           ---- 함수 실행코드
                    * return 변수                 <----반환되는 변수 [ 함수 종료시 돌려주는 값 ]
           4.  구성 요소
                반환O인수O      반환O인수X      반환X인수X     반환X인수O
     */

    public static void main(String[] args) {


    }

}
