package class9.gatter_setter;

public class 실행 {
    public static void main(String[] args) {

        // * 객체 필드에 값 넣는 방법
        // 1.
            // 1. 객체 생성
        회원개인정보 멤버1 = new 회원개인정보();
            // 2. 필드 접근
        //멤버1.이름 ="유재석";
       // 멤버1.전화번호="123-123";
        //멤버1.주민등록번호 = "123123-123123";

        //System.out.println(멤버1.이름);
        
        // 2.
        회원개인정보 멤버2  = new 회원개인정보("강호동","456-456" , "456456-456456");
        // 3.
        회원개인정보 멤버3 = new 회원개인정보();
        멤버3.set이름("신동엽");
        멤버3.set전화번호("123-123");
        멤버3.set주민등록번호("123123-123123");

        System.out.println(멤버3.get이름() );
    }
}
