package class6;

public class page165 {
    /*
        기본타입[변수] vs 참조타입[객체 ]
            1. 기본타입  [ 데이터를 1개만 저장 가능 ]
                1. 변수 [ int double char 등 ]
                2. 값을 변수에 자체적으로 저장 한다 .
                    int 변수 = 10;

                    변수
                     10

            2. 참조타입  [ 데이터를 여러개 저장 가능 ]
                1. 객체 [ 배열 , 클래스 , 인터페이스 등 ]
                2. 값이 저장된 주소(번지) 를 변수에 저장한다.
                    String 변수 = "유재석"

                    변수                      메모리(저장공간)
                     주소위치 --------------->  유재석[ 주소(번지) 위치 ]


     */

}
